import { Blog } from '@/types/blog';

export const profileData: Blog = {
  id: 'profile',
  title: 'プロフィール',
  image: {
    url: '/images/Klogo500x500.png',
  },
  description:
    'くーへんの自己紹介をさせていただきます。なぜ、ブログを書き始めたのか。なぜプログラミングを始めたのか経緯を書いています。',
  body: `
  <p>どうも、くーへんです！</p>
  <p>これは導入分です。これは導入分です。これは導入分です。これは導入分です。これは導入分です。これは導入分です。これは導入分です。これは導入分です。これは導入分です。これは導入分です。</p>
  <p>これは導入分です。これは導入分です。これは導入分です。これは導入分です。これは導入分です。これは導入分です。これは導入分です。これは導入分です。これは導入分です。これは導入分です。</p>
  <p>これは導入分です。これは導入分です。これは導入分です。これは導入分です。これは導入分です。これは導入分です。これは導入分です。これは導入分です。これは導入分です。これは導入分です。</p>
  <h2>はじめに</h2>
  <p>「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。</p>
  <p>「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。</p>
  <p>「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。</p>
  <h3>サブタイトル</h3>
  <p>「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。</p>
  <p>「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。</p>
  <p>「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。</p>
  <h3>サブタイトル</h3>
  <p>「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。</p>
  <p>「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。</p>
  <p>「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。「〇〇をする」の文章です。</p>
  <h3>おわりに</h3>
  <p>「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。</p>
  <p>「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。</p>
  <p>「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。「はじめに」の文章です。</p>
  `,
  category: {
    id: 'profile',
    name: 'プロフィール',
    createdAt: '2022-10-10',
    updatedAt: '2022-10-10',
    publishedAt: '2022-10-10',
    revisedAt: '2022-10-10',
  },
  createdAt: '2022-10-10',
  updatedAt: '2022-10-10',
  publishedAt: '2022-10-10',
  revisedAt: '2022-10-10',
};
