export const profileData = {
  image: {
    url: '/images/Klogo500x500.png',
  },
  description:
    'くーへんの自己紹介をさせていただきます。なぜ、ブログを書き始めたのか。なぜプログラミングを始めたのか経緯を書いています。',
  body: `
  <p>どうも、くーへん(<a href='https://twitter.com/kuchen_22'>@kuhen_22</a>)です！</p>
  <p>くーへんブログご覧いただきありがとうございます。</p>
  <p>ブログをやろうと思ったきっかけなどを書いてみますので良ければ最後までご覧ください。</p>
  <h3>経歴</h3>
  <p>岩手県出身、埼玉県在住の31歳です。結婚して今は嫁と娘の3人暮らしをしています。</p>
  <p>メーカー兼商社で営業マンを本業にしています。なんだかんだで新卒から8年目になりました。複数の拠点を転勤して、今は埼玉県にある営業所で落ち着いています。</p>
  <p>本業の傍ら、平日の夜や土日の空いた時間を見てのんびり個人ブログを開設しました。ブログは一部デザインなど参考にさせていただいたサイトがありますが、コードは全て私が書きました。</p>
  <p>ゆるくのんびり更新して行けたらいいなーと思っていますので是非、見ていっていただけると嬉しいです。</p>
  <h3>ブログを開設しようと思ったきっかけ</h3>
  <p>今の本業が面白くないし、給料も良くないし、残業も多いし、大変だし、仕事もうまくいかないしと踏んだり蹴ったりで転職をしたいと思いました。そこでたまたまプログラミングと出会い、始めはエンジニア転職を目指してみたいと思ったところから始まりました。</p>
  <p>お小遣いを貯め、MacBookを買って、オンラインのプログラミングスクールに通って勉強をしました。しかし、エンジニア転職は年々ハードルが上がっているし、私は30歳未経験なのでスクールを卒業しても転職まで成功させるのは困難でした。</p>
  <p>転職できたとしても初任給は現職より落ちることは間違いないし、家族もいる中で大幅な収入ダウンはできないので、エンジニア転職は諦めて、営業マンxプログラミングとして自分の武器のひとつにできないかと考えるようになりました。</p>
  <p>今までプログラミングを勉強してきた成果物として何か作りたいと思い、このブログサイトを作ってみることにしました。</p>
  <h3>このブログで使用している技術</h3>
  <p>素人の私が書くのは恐れ多いですが、このサイトで使用している技術を簡単に書いてみます</p>
  <p>このグログはJAMスタックの構成で開発しています。フレームワークとしては<a href='https://nextjs.org/'>Next.js</a>を使用しています。言語には<a href='https://www.typescriptlang.org/'>TypeScript</a>で書いています。コンテンツ管理には<a href='https://microcms.io/'>microcms</a>を利用しています。</p>
  <p>それぞれの技術やツールについて完璧に理解できているとは思っていないので日々勉強しながら少しずつ成長して良いサイトにしていきたいと思います。このサイトは全て私が一からコードを書いて作ってきました。何か不具合や改善点があればTwitterのDMかお問合せページからご連絡をいただけますと幸いです。</p>
  <h3>ブログの記事はどんなことを書くか</h3>
  <p>ブログの内容としては雑記ブログになります。プログラミングのこと、営業マンとしての仕事のことや効率化のこと、旅行やグルメのこと、たまには商品紹介など、特にジャンルにこだわりを持たずいろんなことを書いていみたいと思います。</p>
  <p>できるだけ分類ごとにみやすくするように工夫したいと思いますので、気になるものがあれば見ていただけると幸いです。コメント機能は今の所つける予定はありませんので、参考になった、面白かったと思ってもらえた記事があればSNSへのシェアをお願いします。</p>
  `,
};
